Feature: Admin dashboard feature
    Background: logged with applicant
        Given I logged in with applicant
        Then Applicant dashboard page should open completely

    Scenario Outline: Verify load page "<Topic>"
        When I Close Workflow Guide Modal
        And I click on the new ticket registration button
        # Then ticket page should open completely
        When I choose "<Topic>" as the topic of the ticket
        And I select the ticket type "<Type>"
        And I choose "<Priority>" ticket priority
        And I enter " <Topic> - <Type> - <Priority> " in the message field
        And I click submit button
        Then The system should display a success message

        Examples:
            | Topic               | Type                    | Priority |
            | ثبت معرفی نامه      | خطا در سیستم نرم افزاری | کم       |
            | ثبت معرفی نامه      | خطا در سیستم نرم افزاری | متوسط    |
            | ثبت معرفی نامه      | خطا در سیستم نرم افزاری | بالا     |
            | ثبت معرفی نامه      | عدم آگاهی               | کم       |
            | ثبت معرفی نامه      | عدم آگاهی               | متوسط    |
            | ثبت معرفی نامه      | عدم آگاهی               | بالا     |
            | ثبت معرفی نامه      | قطعی سیستم              | کم       |
            | ثبت معرفی نامه      | قطعی سیستم              | متوسط    |
            | ثبت معرفی نامه      | قطعی سیستم              | بالا     |
            | ثبت معرفی نامه      | عملکرد نادرست سیستم     | کم       |
            | ثبت معرفی نامه      | عملکرد نادرست سیستم     | متوسط    |
            | ثبت معرفی نامه      | عملکرد نادرست سیستم     | بالا     |
            | آپلود فایل          | خطا در سیستم نرم افزاری | کم       |
            | آپلود فایل          | خطا در سیستم نرم افزاری | متوسط    |
            | آپلود فایل          | خطا در سیستم نرم افزاری | بالا     |
            | آپلود فایل          | عدم آگاهی               | کم       |
            | آپلود فایل          | عدم آگاهی               | متوسط    |
            | آپلود فایل          | عدم آگاهی               | بالا     |
            | آپلود فایل          | قطعی سیستم              | کم       |
            | آپلود فایل          | قطعی سیستم              | متوسط    |
            | آپلود فایل          | قطعی سیستم              | بالا     |
            | آپلود فایل          | عملکرد نادرست سیستم     | کم       |
            | آپلود فایل          | عملکرد نادرست سیستم     | متوسط    |
            | آپلود فایل          | عملکرد نادرست سیستم     | بالا     |
            | انتخاب دفتر ثبت نام | خطا در سیستم نرم افزاری | کم       |
            | انتخاب دفتر ثبت نام | خطا در سیستم نرم افزاری | متوسط    |
            | انتخاب دفتر ثبت نام | خطا در سیستم نرم افزاری | بالا     |
            | انتخاب دفتر ثبت نام | عدم آگاهی               | کم       |
            | انتخاب دفتر ثبت نام | عدم آگاهی               | متوسط    |
            | انتخاب دفتر ثبت نام | عدم آگاهی               | بالا     |
            | انتخاب دفتر ثبت نام | قطعی سیستم              | کم       |
            | انتخاب دفتر ثبت نام | قطعی سیستم              | متوسط    |
            | انتخاب دفتر ثبت نام | قطعی سیستم              | بالا     |
            | انتخاب دفتر ثبت نام | عملکرد نادرست سیستم     | کم       |
            | انتخاب دفتر ثبت نام | عملکرد نادرست سیستم     | متوسط    |
            | انتخاب دفتر ثبت نام | عملکرد نادرست سیستم     | بالا     |
            | تعیین قرار ملاقات   | خطا در سیستم نرم افزاری | کم       |
            | تعیین قرار ملاقات   | خطا در سیستم نرم افزاری | متوسط    |
            | تعیین قرار ملاقات   | خطا در سیستم نرم افزاری | بالا     |
            | تعیین قرار ملاقات   | عدم آگاهی               | کم       |
            | تعیین قرار ملاقات   | عدم آگاهی               | متوسط    |
            | تعیین قرار ملاقات   | عدم آگاهی               | بالا     |
            | تعیین قرار ملاقات   | قطعی سیستم              | کم       |
            | تعیین قرار ملاقات   | قطعی سیستم              | متوسط    |
            | تعیین قرار ملاقات   | قطعی سیستم              | بالا     |
            | تعیین قرار ملاقات   | عملکرد نادرست سیستم     | کم       |
            | تعیین قرار ملاقات   | عملکرد نادرست سیستم     | متوسط    |
            | تعیین قرار ملاقات   | عملکرد نادرست سیستم     | بالا     |
            | پرداخت هزینه        | خطا در سیستم نرم افزاری | کم       |
            | پرداخت هزینه        | خطا در سیستم نرم افزاری | متوسط    |
            | پرداخت هزینه        | خطا در سیستم نرم افزاری | بالا     |
            | پرداخت هزینه        | عدم آگاهی               | کم       |
            | پرداخت هزینه        | عدم آگاهی               | متوسط    |
            | پرداخت هزینه        | عدم آگاهی               | بالا     |
            | پرداخت هزینه        | قطعی سیستم              | کم       |
            | پرداخت هزینه        | قطعی سیستم              | متوسط    |
            | پرداخت هزینه        | قطعی سیستم              | بالا     |
            | پرداخت هزینه        | عملکرد نادرست سیستم     | کم       |
            | پرداخت هزینه        | عملکرد نادرست سیستم     | متوسط    |
            | پرداخت هزینه        | عملکرد نادرست سیستم     | بالا     |
            | عدم ارسال پیامک     | خطا در سیستم نرم افزاری | کم       |
            | عدم ارسال پیامک     | خطا در سیستم نرم افزاری | متوسط    |
            | عدم ارسال پیامک     | خطا در سیستم نرم افزاری | بالا     |
            | عدم ارسال پیامک     | عدم آگاهی               | کم       |
            | عدم ارسال پیامک     | عدم آگاهی               | متوسط    |
            | عدم ارسال پیامک     | عدم آگاهی               | بالا     |
            | عدم ارسال پیامک     | قطعی سیستم              | کم       |
            | عدم ارسال پیامک     | قطعی سیستم              | متوسط    |
            | عدم ارسال پیامک     | قطعی سیستم              | بالا     |
            | عدم ارسال پیامک     | عملکرد نادرست سیستم     | کم       |
            | عدم ارسال پیامک     | عملکرد نادرست سیستم     | متوسط    |
            | عدم ارسال پیامک     | عملکرد نادرست سیستم     | بالا     |